In [1]:
import pandas as  pd
import os
from sqlalchemy import create_engine
import sqlite3
import matplotlib.pyplot as plt
import seaborn as sns

In [9]:
engine = create_engine('sqlite:///inventory.db')
engine

Engine(sqlite:///inventory.db)

In [27]:
path = 'D:\Data sets\Supply Chain analytics\Dataset\Dataset\Postgres Input files'
print(os.listdir(path))

['dim_customers.csv', 'dim_products.csv', 'dim_targets_orders.csv', 'fact_aggregate.csv', 'fact_order_line.csv']

<>:1: SyntaxWarning: invalid escape sequence '\D'
<>:1: SyntaxWarning: invalid escape sequence '\D'
C:\Users\Mithunsomu\AppData\Local\Temp\ipykernel_23500\1871467580.py:1: SyntaxWarning: invalid escape sequence '\D'
  path = 'D:\Data sets\Supply Chain analytics\Dataset\Dataset\Postgres Input files'

In [53]:
def ingestion(dataframe, table_name, engine):
    dataframe.to_sql(table_name, con = engine)

for item in os.listdir(path):
    if '.csv' in item:
        print(item)
        df = pd.read_csv(f'D:\Data sets\Supply Chain analytics\Dataset\Dataset\Postgres Input files/{item}')
        print(df.head())
        ingestion(df, item[:-4], engine)

<>:7: SyntaxWarning: invalid escape sequence '\D'
<>:7: SyntaxWarning: invalid escape sequence '\D'
C:\Users\Mithunsomu\AppData\Local\Temp\ipykernel_23500\2650396436.py:7: SyntaxWarning: invalid escape sequence '\D'
  df = pd.read_csv(f'D:\Data sets\Supply Chain analytics\Dataset\Dataset\Postgres Input files/{item}')

dim_customers.csv
   customer_id     customer_name            city currency
0       789101  Costco Wholesale  New Jersey, US      USD
1       789102      Vijay Stores       Ahmedabad      INR
2       789103      Vijay Stores        Vadodara      INR
3       789121          Coolblue       Ahmedabad      INR
4       789122          Coolblue        Vadodara      INR
dim_products.csv
    product_name  product_id category  price_INR  price_USD
0    AM Milk 500    25891101    Dairy        125        4.0
1    AM Milk 250    25891102    Dairy         62        2.0
2    AM Milk 100    25891103    Dairy         25        1.0
3  AM Butter 100    25891201    Dairy         60        2.0
4  AM Butter 250    25891202    Dairy        150        4.0
dim_targets_orders.csv
   customer_id  ontime_target%  infull_target%  otif_target%
0       789201              87              81            70
1       789202              85              81            69
2       789203              92              76            70
3       789301              89              78            69
4       789303              88              78            69
fact_aggregate.csv
      order_id  customer_id order_placement_date  on_time  in_full  otif
0  FMR32103503       789103           01-03-2025        1        0     0
1  FMR34103403       789103           01-03-2025        1        0     0
2  FMR32103602       789103           01-03-2025        1        0     0
3  FMR33103602       789103           01-03-2025        1        0     0
4  FMR33103401       789103           01-03-2025        1        0     0
fact_order_line.csv
      order_id order_placement_date  customer_id  product_id  order_qty  \
0  FMR34203601           01-03-2025       789203    25891601        110
1  FMR32320302           01-03-2025       789320    25891203        347
2  FMR33320501           01-03-2025       789320    25891203        187
3  FMR34220601           01-03-2025       789220    25891203        235
4  FMR33703603           01-03-2025       789703    25891203        176

  agreed_delivery_date actual_delivery_date  delivery_qty  In Full  On Time  \
0           04-03-2025           04-03-2025           110        1        1
1           02-03-2025           02-03-2025           347        1        1
2           03-03-2025           03-03-2025           150        0        1
3           04-03-2025           04-03-2025           235        1        1
4           03-03-2025           03-03-2025           176        1        1

   On Time In Full
0                1
1                1
2                0
3                1
4                1

In [4]:
conn = sqlite3.connect('inventory.db')
conn

In [6]:
tables = pd.read_sql_query('select name from sqlite_master where type = "table"', con = conn)
tables

                 name
0       dim_customers
1        dim_products
2  dim_targets_orders
3      fact_aggregate
4     fact_order_line
5            dim_date

In [8]:
dim_customers = pd.read_sql('select * from dim_customers', con = conn)
product_df = pd.read_sql('select * from dim_products', con = conn)
dim_targets_orders = pd.read_sql('select * from dim_targets_orders', con = conn)
fact_aggregate = pd.read_sql('select * from fact_aggregate', con = conn)
order_df = pd.read_sql('select * from fact_order_line', con = conn)

In [140]:
order_df = fact_order_line

In [192]:
product_df = dim_products

In [10]:
dim_customers.head()

   index  customer_id     customer_name            city currency
0      0       789101  Costco Wholesale  New Jersey, US      USD
1      1       789102      Vijay Stores       Ahmedabad      INR
2      2       789103      Vijay Stores        Vadodara      INR
3      3       789121          Coolblue       Ahmedabad      INR
4      4       789122          Coolblue        Vadodara      INR

In [12]:
product_df.head()

   index   product_name  product_id category  price_INR  price_USD
0      0    AM Milk 500    25891101    Dairy        125        4.0
1      1    AM Milk 250    25891102    Dairy         62        2.0
2      2    AM Milk 100    25891103    Dairy         25        1.0
3      3  AM Butter 100    25891201    Dairy         60        2.0
4      4  AM Butter 250    25891202    Dairy        150        4.0

In [13]:
dim_targets_orders.head()

   index  customer_id  ontime_target%  infull_target%  otif_target%
0      0       789201              87              81            70
1      1       789202              85              81            69
2      2       789203              92              76            70
3      3       789301              89              78            69
4      4       789303              88              78            69

In [16]:
fact_aggregate.head()

,index,order_id,customer_id,order_placement_date,on_time,in_full,otif
0,0,FMR32103503,789103,01-03-2025,1,0,0
1,1,FMR34103403,789103,01-03-2025,1,0,0
2,2,FMR32103602,789103,01-03-2025,1,0,0
3,3,FMR33103602,789103,01-03-2025,1,0,0
4,4,FMR33103401,789103,01-03-2025,1,0,0

In [18]:
order_df.head()

,index,order_id,order_placement_date,customer_id,product_id,order_qty,agreed_delivery_date,actual_delivery_date,delivery_qty,In Full,On Time,On Time In Full
0,0,FMR34203601,01-03-2025,789203,25891601,110,04-03-2025,04-03-2025,110,1,1,1
1,1,FMR32320302,01-03-2025,789320,25891203,347,02-03-2025,02-03-2025,347,1,1,1
2,2,FMR33320501,01-03-2025,789320,25891203,187,03-03-2025,03-03-2025,150,0,1,0
3,3,FMR34220601,01-03-2025,789220,25891203,235,04-03-2025,04-03-2025,235,1,1,1
4,4,FMR33703603,01-03-2025,789703,25891203,176,03-03-2025,03-03-2025,176,1,1,1

In [20]:
date_range = pd.date_range(start = '2025-03-01', end = '2025-05-31', freq='D')
date_range

DatetimeIndex(['2025-03-01', '2025-03-02', '2025-03-03', '2025-03-04',
               '2025-03-05', '2025-03-06', '2025-03-07', '2025-03-08',
               '2025-03-09', '2025-03-10', '2025-03-11', '2025-03-12',
               '2025-03-13', '2025-03-14', '2025-03-15', '2025-03-16',
               '2025-03-17', '2025-03-18', '2025-03-19', '2025-03-20',
               '2025-03-21', '2025-03-22', '2025-03-23', '2025-03-24',
               '2025-03-25', '2025-03-26', '2025-03-27', '2025-03-28',
               '2025-03-29', '2025-03-30', '2025-03-31', '2025-04-01',
               '2025-04-02', '2025-04-03', '2025-04-04', '2025-04-05',
               '2025-04-06', '2025-04-07', '2025-04-08', '2025-04-09',
               '2025-04-10', '2025-04-11', '2025-04-12', '2025-04-13',
               '2025-04-14', '2025-04-15', '2025-04-16', '2025-04-17',
               '2025-04-18', '2025-04-19', '2025-04-20', '2025-04-21',
               '2025-04-22', '2025-04-23', '2025-04-24', '2025-04-25',
               '2025-04-26', '2025-04-27', '2025-04-28', '2025-04-29',
               '2025-04-30', '2025-05-01', '2025-05-02', '2025-05-03',
               '2025-05-04', '2025-05-05', '2025-05-06', '2025-05-07',
               '2025-05-08', '2025-05-09', '2025-05-10', '2025-05-11',
               '2025-05-12', '2025-05-13', '2025-05-14', '2025-05-15',
               '2025-05-16', '2025-05-17', '2025-05-18', '2025-05-19',
               '2025-05-20', '2025-05-21', '2025-05-22', '2025-05-23',
               '2025-05-24', '2025-05-25', '2025-05-26', '2025-05-27',
               '2025-05-28', '2025-05-29', '2025-05-30', '2025-05-31'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df = pd.DataFrame({
    'date' : date_range,
    'year' : date_range.year,
    'month' : date_range.month,
    'day' : date_range.day,
    'day_name' : date_range.day_name(),
    'month_name' : date_range.month_name(),
    'week_of_year' : date_range.isocalendar().week,
    'is_weekend' : date_range.dayofweek.isin([5,6])
})
df.head()

,date,year,month,day,day_name,month_name,week_of_year,is_weekend
2025-03-01,2025-03-01,2025,3,1,Saturday,March,9,True
2025-03-02,2025-03-02,2025,3,2,Sunday,March,9,True
2025-03-03,2025-03-03,2025,3,3,Monday,March,10,False
2025-03-04,2025-03-04,2025,3,4,Tuesday,March,10,False
2025-03-05,2025-03-05,2025,3,5,Wednesday,March,10,False

In [115]:
df.to_sql('dim_date',con = conn)

92

In [24]:
pd.read_sql('select name  from sqlite_master where type = "table"',con = conn)

                 name
0       dim_customers
1        dim_products
2  dim_targets_orders
3      fact_aggregate
4     fact_order_line
5            dim_date

## Cleaning data and modified approach

In [26]:
order_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24195 entries, 0 to 24194
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   index                 24195 non-null  int64
 1   order_id              24195 non-null  object
 2   order_placement_date  24195 non-null  object
 3   customer_id           24195 non-null  int64
 4   product_id            24195 non-null  int64
 5   order_qty             24195 non-null  int64
 6   agreed_delivery_date  24195 non-null  object
 7   actual_delivery_date  24195 non-null  object
 8   delivery_qty          24195 non-null  int64
 9   In Full               24195 non-null  int64
 10  On Time               24195 non-null  int64
 11  On Time In Full       24195 non-null  int64
dtypes: int64(8), object(4)
memory usage: 2.2+ MB

In [27]:
order_df[['customer_id','product_id']] = order_df[['customer_id','product_id']].astype(int)

In [29]:
order_df['agreed_delivery_date'] = pd.to_datetime(order_df['agreed_delivery_date'], dayfirst = True)

In [179]:
order_df['actual_delivery_date'] = pd.to_datetime(order_df['actual_delivery_date'], dayfirst = True)

In [181]:
order_df['order_placement_date'] = pd.to_datetime(order_df['order_placement_date'], dayfirst = True)

## Merging columns into one dataframe

In [272]:
merged_df = order_df.merge(product_df, on = 'product_id', how='left')
merged_df.shape

(24195, 17)

In [226]:
#Calculated total summary in INR
merged_df['total_summary_INR'] = merged_df['price_INR']*merged_df['price_USD']
merged_df['total_summary_INR']

0        1350.0
1        2700.0
2        2700.0
3        2700.0
4        2700.0
          ...
24190      45.0
24191      45.0
24192      45.0
24193      45.0
24194      45.0
Name: total_summary_INR, Length: 24195, dtype: float64

In [268]:
final_df = merged_df[['order_id','order_placement_date','customer_id','product_id','product_name','category','order_qty','agreed_delivery_date','actual_delivery_date','delivery_qty','In Full','On Time','On Time In Full','total_summary_INR']]

In [270]:
final_df.shape

(24195, 14)

## KPI's

In [32]:
order_df['order_id']

0         FMR34203601
1         FMR32320302
2         FMR33320501
3         FMR34220601
4         FMR33703603
             ...
24190    FMY519420603
24191    FMY517121603
24192    FMY517622603
24193    FMY517402603
24194    FMY517422603
Name: order_id, Length: 24195, dtype: object

In [49]:
order_agg = len(fact_aggregate)-1
order_agg

13466

In [182]:
order_lines = len(order_df)-1
order_lines

24194

In [51]:
#Calculating KPI's

In [184]:
total_order_lines = len(order_df)-1
total_order_lines

24194

In [194]:
line_fill_rate = (order_df['In Full']  ==1).mean()*100
line_fill_ra

65.93097747468485

In [98]:
volume_fill_rate = (order_df['delivery_qty'].sum()/order_df['order_qty'].sum())*100
volume_fill_rate

96.59501857499619

In [123]:
total_orders = len(fact_aggregate['order_id'])-1
total_orders
#or len(order_df['order_id'].unique())-1

13466

In [202]:
on_time_delivery = (fact_aggregate['on_time'] ==1).mean()*100
on_time_delivery

59.218831217049086

In [200]:
in_full_delivery = (fact_aggregate['in_full'] ==1).mean()*100
in_full_delivery

52.55810499740106

In [154]:
otif = (fact_aggregate['otif']==1).mean()*100
otif

28.707210217568875

In [174]:
KPI_data = {
    'KPI':[
        'Total Order Lines',
        'Line Full Rate (%)',
        'Volume Fill Rate (%)',
        'Total Orders',
        'On Time Delivery (%)',
        'In Full Delivery (%)',
        'On Time In Full (%)'
    ],
    'Values':[
        f'{total_order_lines:.0f}',
        f'{line_fill_rate:.1f}%',
        f'{volume_fill_rate:.1f}%',
        f'{total_orders:,.0f}',
        f'{on_time_delivery:.1f}%',
        f'{in_full_delivery:.1f}%',
        f'{otif:.1f}%'
    ]
}
KPI_data

{'KPI': ['Total Order Lines',
  'Line Full Rate (%)',
  'Volume Fill Rate (%)',
  'Total Orders',
  'On Time Delivery (%)',
  'In Full Delivery (%)',
  'On Time In Full (%)'],
 'Values': ['24194', '65.9%', '96.6%', '13,466', '71.2%', '52.6%', '28.7%']}

In [176]:
pd.DataFrame(KPI_data)

                    KPI  Values
0     Total Order Lines   24194
1    Line Full Rate (%)   65.9%
2  Volume Fill Rate (%)   96.6%
3          Total Orders  13,466
4  On Time Delivery (%)   71.2%
5  In Full Delivery (%)   52.6%
6   On Time In Full (%)   28.7%